//
//  Language.swift
//  Translator
//
//  Created by Андрей Понамарчук on 25.10.2019.
//  Copyright © 2019 Андрей Понамарчук. All rights reserved.
//

import Foundation

let supportedLanguages = ["азербайджанский":"az","албанский":"sq","амхарский":"am","английский":"en","арабский":"ar","армянский":"hy","африкаанс":"af","баскский":"eu","башкирский":"ba","белорусский":"be","бенгальский":"bn","бирманский":"my","болгарский":"bg","боснийский":"bs","валлийский":"cy","венгерский":"hu","вьетнамский":"vi","гаитянский (креольский)":"ht","галисийский":"gl","голландский":"nl","горномарийский":"mrj","греческий":"el","грузинский":"ka","гуджарати":"gu","датский":"da","иврит":"he","идиш":"yi","индонезийский":"id","ирландский":"ga","итальянский":"it","исландский":"is","испанский":"es","казахский":"kk","каннада":"kn","каталанский":"ca","киргизский":"ky","китайский":"zh","корейский":"ko","коса":"xh","кхмерский":"km","лаосский":"lo","латынь":"la","латышский":"lv","литовский":"lt","люксембургский":"lb","малагасийский":"mg","малайский":"ms","малаялам":"ml","мальтийский":"mt","македонский":"mk","маори":"mi","маратхи":"mr","марийский":"mhr","монгольский":"mn","немецкий":"de","непальский":"ne","норвежский":"no","панджаби":"pa","папьяменто":"pap","персидский":"fa","польский":"pl","португальский":"pt","румынский":"ro","русский":"ru","себуанский":"ceb","сербский":"sr","сингальский":"si","словацкий":"sk","словенский":"sl","суахили":"sw","сунданский":"su","таджикский":"tg","тайский":"th","тагальский":"tl","тамильский":"ta","татарский":"tt","телугу":"te","турецкий":"tr","удмуртский":"udm","узбекский":"uz","украинский":"uk","урду":"ur","финский":"fi","французский":"fr","хинди":"hi","хорватский":"hr","чешский":"cs","шведский":"sv","шотландский":"gd","эстонский":"et","эсперанто":"eo","яванский":"jv","японский":"ja"]

protocol LanguageProtocol {
    var name: String { get set }
    var code: String { get }
}

class Language: LanguageProtocol {
    var name: String
    var code: String {
        get {
            return supportedLanguages[name] ?? ""
        }
    }
    init(languageName:String) {
        name = languageName
    }
}
